namespace OnlineDoctorSystem.Data.Seeding
{
    using System;
    using System.Collections.Generic;
    using System.Linq;
    using System.Threading.Tasks;

    using OnlineDoctorSystem.Data.Models;

    public class SpecialtiesSeeder : ISeeder
    {
        public async Task SeedAsync(ApplicationDbContext dbContext, IServiceProvider serviceProvider)
        {
            if (dbContext.Specialties.Any())
            {
                return;
            }

            var specialties = new List<string>()
            {
                "Алерголог",
                "Ангиолог",
                "Анестезиолог",
                "Аюрведа",
                "Боуен терапевт",
                "Вирусолог",
                "Вътрешни болести",
                "Гастроентеролог",
                "Гръден хирург",
                "Дерматолог",
                "Детски гастроентеролог",
                "Детски ендокринолог",
                "Детски кардиолог",
                "Детски невролог",
                "Детски нефролог",
                "Детски психиатър",
                "Детски пулмолог",
                "Детски ревматолог",
                "Детски хематолог",
                "Детски хирург",
                "Диетолог",
                "Ендокринолог",
                "Естетичен дерматолог",
                "Зъболекар (Стоматолог)",
                "Изследване",
                "Имунолог",
                "Инфекциозни болести",
                "Кардиолог",
                "Кардиохирург",
                "Кинезитерапевт",
                "Клинична генетика",
                "Клинична лаборатория",
                "Лицево-челюстен хирург",
                "Логопед",
                "Мамолог",
                "Микробиолог",
                "Невролог",
                "Неврохирург",
                "Неонатолог",
                "Нефролог",
                "Образна диагностика",
                "Общопрактикуващ лекар",
                "Озонотерапевт",
                "Онколог",
                "Орален хирург",
                "Ортодонт",
                "Ортопед",
                "Отоневролог",
                "Офталмолог (Очен лекар)",
                "Паразитолог",
                "Педиатър",
                "Пластичен хирург",
                "Профилактични прегледи",
                "Психиатър",
                "Психолог",
                "Психотерапевт",
                "Пулмолог (Белодробни болести)",
                "Ревматолог",
                "Репродуктивна медицина",
                "Рехабилитатор",
                "Спортна медицина",
                "Съдов хирург",
                "Токсиколог",
                "УНГ",
                "Уролог",
                "Физиотерапевт",
                "Хематолог (Клинична хематология)",
                "Хематолог (Трансфузионна хематология)",
                "Хирург",
                "Хомеопат",
            };
            foreach (var specialty in specialties)
            {
                await dbContext.Specialties.AddAsync(new Specialty() { Name = specialty });
            }
        }
    }
}
